{
  "entities": {
    "Log": {
      "title": "Log Entry",
      "description": "Glucose, meal, or insulin bolus record",
      "type": "object",
      "properties": {
        "type": { "type": "string", "enum": ["glucose", "meal", "bolus"] },
        "value": { "type": "number" },
        "timestamp": { "type": "number" },
        "description": { "type": "string" },
        "carbs": { "type": "number" },
        "insulin": { "type": "number" },
        "protein": { "type": "number" },
        "fat": { "type": "number" }
      },
      "required": ["type", "value", "timestamp"]
    },
    "AiReport": {
      "title": "AI Analysis Report",
      "description": "Generated analysis from Gemini",
      "type": "object",
      "properties": {
        "type": { "type": "string" },
        "content": { "type": "string" },
        "timestamp": { "type": "number" }
      },
      "required": ["type", "content", "timestamp"]
    },
    "UserProfile": {
      "title": "User Profile",
      "description": "User specific settings",
      "type": "object",
      "properties": {
        "targetMin": { "type": "number" },
        "targetMax": { "type": "number" },
        "tdi": { "type": "number" },
        "notificationsEnabled": { "type": "boolean" },
        "carelink": {
          "type": "object",
          "properties": {
            "username": { "type": "string" },
            "password": { "type": "string" },
            "region": { "type": "string", "enum": ["US", "EU", "JP", "CN", "AU"] },
            "enabled": { "type": "boolean" },
            "lastSync": { "type": "number" }
          }
        },
        "notificationPrefs": {
          "type": "object",
          "properties": {
            "hypo": { "type": "boolean" },
            "hyper": { "type": "boolean" },
            "reminders": { "type": "boolean" },
            "predictions": { "type": "boolean" }
          }
        },
        "apiSecretHashes": { 
          "type": "array",
          "items": { "type": "string" }
        }
      }
    },
    "ApiSecretMapping": {
      "title": "API Secret Mapping",
      "description": "Maps an API secret SHA1 hash back to a userId",
      "type": "object",
      "properties": {
        "userId": { "type": "string" },
        "createdAt": { "type": "number" }
      },
      "required": ["userId", "createdAt"]
    },
    "NeuralBackup": {
      "title": "GlikoSense Neural Backup",
      "description": "Backup of the GlikoSense offline neural network",
      "type": "object",
      "properties": {
        "modelTopology": { "type": "object" },
        "weightSpecs": { "type": "array" },
        "weightDataB64": { "type": "string" },
        "timestamp": { "type": "number" }
      },
      "required": ["modelTopology", "weightSpecs", "weightDataB64", "timestamp"]
    }
  },
  "firestore": {
    "/artifacts/diacontrolapp/apiSecrets/{apiSecretHash}": {
      "schema": "ApiSecretMapping",
      "description": "Registry of hashed API secrets to userIds"
    },
    "/artifacts/diacontrolapp/users/{userId}/logs/{logId}": {
      "schema": "Log",
      "description": "User activity logs"
    },
    "/artifacts/diacontrolapp/users/{userId}/aiReports/{reportId}": {
      "schema": "AiReport",
      "description": "Stored AI reports"
    },
    "/artifacts/diacontrolapp/users/{userId}/settings/profile": {
      "schema": "UserProfile",
      "description": "User profile settings"
    },
    "/artifacts/diacontrolapp/users/{userId}/neural_model/backup": {
      "schema": "NeuralBackup",
      "description": "GlikoSense neural network backup"
    }
  }
}
